In [2]:
import pandas as pd

###### Read CSV

In [3]:
data = pd.read_csv('indeed_jobs.csv')

###### Exploratory Data Analysis

In [4]:
data.head()

                                                text           title
0  tampa fl month cth requires active ts sci a da...  Data Scientist
1  summary posted feb weekly hours role number th...  Data Scientist
2  about us twitch is the world s biggest live st...  Data Scientist
3  clear demand company overview clear demand del...  Data Scientist
4  transunion s job applicant privacy notice what...  Data Scientist

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13890 entries, 0 to 13889
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   text    13889 non-null  object
 1   title   13889 non-null  object
dtypes: object(2)
memory usage: 217.2+ KB

###### Counts unique values

In [6]:
data['title'].value_counts()

Data Scientist       8224
software engineer    5435
Data Scientists       230
Name: title, dtype: int64

###### replacing values

In [7]:
data['title'] = data['title'].replace("Data Scientists", "Data Scientist")

In [8]:
data['title'].value_counts()

Data Scientist       8454
software engineer    5435
Name: title, dtype: int64

###### Check Null values

In [9]:
data.isnull().sum()

text     1
title    1
dtype: int64

In [10]:
data = data.dropna()

In [11]:
data.isnull().sum()

text     0
title    0
dtype: int64

###### Drop Duplicate values

In [36]:
df = data

df = df.drop_duplicates('text', keep='last')

print(df)

                                                    text              title
49     must haves years serving in a data analytics r...     Data Scientist
50     the challenge are you excited at the prospect ...     Data Scientist
54     basic qualifications bachelor s degree or comm...     Data Scientist
62     duties directs an intricate program of data sc...     Data Scientist
63     daily functions and duties of this role requir...     Data Scientist
...                                                  ...                ...
13885  hands on experience with provisioning maintain...  software engineer
13886  what does a great sr application analyst do th...  software engineer
13887  job description the role healthcare group hcg ...  software engineer
13888  imagine working at intellibus to engineer plat...  software engineer
13889  we are seeking creative and talented individua...  software engineer

[2981 rows x 2 columns]

In [37]:
df['title'].value_counts()

software engineer    1807
Data Scientist       1174
Name: title, dtype: int64

In [58]:
### Reset index

In [38]:
df = df.reset_index(drop=True)

In [39]:
df.head()

                                                text           title
0  must haves years serving in a data analytics r...  Data Scientist
1  the challenge are you excited at the prospect ...  Data Scientist
2  basic qualifications bachelor s degree or comm...  Data Scientist
3  duties directs an intricate program of data sc...  Data Scientist
4  daily functions and duties of this role requir...  Data Scientist

###### making it as Numeric binary dataset , where Data Scientist is 1 and software engineer is 0

In [40]:
df['title'] = df['title'].replace("Data Scientist", 1)
df['title'] = df['title'].replace("software engineer", 0)

######  Found Data imbalance

In [41]:
df['title'].value_counts()

0    1807
1    1174
Name: title, dtype: int64

In [42]:
df_DS = df[df['title'] == 1]
df_SW = df[df['title'] == 0]

In [45]:
df_DS['title'].value_counts()

1    1174
Name: title, dtype: int64

In [46]:
df_SW['title'].value_counts()

0    1807
Name: title, dtype: int64

###### selecting the first 1174 data of software engineer dataset to match the data scientists dataset

In [47]:
SW = df_SW.iloc[:1174,:]

In [48]:
SW['title'].value_counts()

0    1174
Name: title, dtype: int64

In [59]:
###Concatenate the two dataframes

In [49]:
new_data = pd.concat([SW, df_DS], axis=0)

In [50]:
new_data.head()

                                                 text  title
42  job description the automation engineer role r...      0
43  our client an insurance company is looking to ...      0
44  fullstack node developer fast growing fintech ...      0
45  sr java developer location nyc for flexible hy...      0
46  a sr cloud engineer job in broomfield co is cu...      0

In [51]:
new_data['title'].value_counts()

0    1174
1    1174
Name: title, dtype: int64

###### Mixing the order of the dataset to random order and resetting the index

In [52]:
df = new_data.sample(frac=1).reset_index(drop=True)

In [53]:
df.head()

                                                text  title
0  honda performance development inc a leader in ...      0
1  data lake architect w saas remote months contr...      1
2  senior software engineer qrypt is a post quant...      0
3  as a staff software engineer backend you will ...      0
4  we are looking for problem solvers with master...      1

###### We have equal number of data science and software engineer jobs , so that the ML model training would not be biased

In [55]:
df['title'].value_counts()

0    1174
1    1174
Name: title, dtype: int64

###### Save to CSV file

In [57]:
df.to_csv('Data.csv',index=False)